examples/09_k3.0_flow/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDEMDict;
}

bodyNames ("PH_SC_prefill" "PH_SC_inlet");

interpolationSchemes
{
    U cell;
}

surfaceThreshold    1e-4;

// Maximum DEM substep = stepDEM * maxDeltaT = 0.01 * 1e-3 = 1e-5 s.
stepDEM              0.01;
geometricD           (1 1 1);
recordSimulation     true;
recordFirstTimeStep  true;

// Safety ceiling for constructor-time generation.  The fieldBased prefill
// stops naturally when lambda reaches 0.20, normally at about 789 bodies.
// Runtime inlet replenishment is not limited by this constructor ceiling.
nSolidsInDomain      2000;

outputSetup
{
    basic       false;
    iB          false;
    DEM         false;
    addModel    false;
    parallelDEM false;
}

DEM
{
    LcCoeff        4.0;
    rotationModel  mindlin1953;

    materials
    {
        particle
        {
            Y       5e8;
            nu      0.5;
            mu      1.0;
            adhN    0;
            eps     0.75;
        }

        wall
        {
            Y       5e8;
            nu      0.5;
            mu      1.0;
            adhN    0;
            eps     0.75;
        }
    }

    cyclicPatches
    {
    }

    collisionPatches
    {
        // Downstream 10 mm x 10 mm throat, y = 0--25 mm.
        xMin_small
        {
            material    wall;
            nVec        (-1 0 0);
            planePoint  (-0.005 0 0);

            finitePatch true;
            minBound    (-0.005 0.000 -0.005);
            maxBound    (-0.005 0.025  0.005);
        }

        xMax_small
        {
            material    wall;
            nVec        (1 0 0);
            planePoint  (0.005 0 0);

            finitePatch true;
            minBound    (0.005 0.000 -0.005);
            maxBound    (0.005 0.025  0.005);
        }

        zMin_small
        {
            material    wall;
            nVec        (0 0 -1);
            planePoint  (0 0 -0.005);

            finitePatch true;
            minBound    (-0.005 0.000 -0.005);
            maxBound    ( 0.005 0.025 -0.005);
        }

        zMax_small
        {
            material    wall;
            nVec        (0 0 1);
            planePoint  (0 0 0.005);

            finitePatch true;
            minBound    (-0.005 0.000 0.005);
            maxBound    ( 0.005 0.025 0.005);
        }

        // Upstream 40 mm x 40 mm reservoir, y = 25--75 mm.
        xMin_large
        {
            material    wall;
            nVec        (-1 0 0);
            planePoint  (-0.020 0 0);

            finitePatch true;
            minBound    (-0.020 0.025 -0.020);
            maxBound    (-0.020 0.075  0.020);
        }

        xMax_large
        {
            material    wall;
            nVec        (1 0 0);
            planePoint  (0.020 0 0);

            finitePatch true;
            minBound    (0.020 0.025 -0.020);
            maxBound    (0.020 0.075  0.020);
        }

        zMin_large
        {
            material    wall;
            nVec        (0 0 -1);
            planePoint  (0 0 -0.020);

            finitePatch true;
            minBound    (-0.020 0.025 -0.020);
            maxBound    ( 0.020 0.075 -0.020);
        }

        zMax_large
        {
            material    wall;
            nVec        (0 0 1);
            planePoint  (0 0 0.020);

            finitePatch true;
            minBound    (-0.020 0.025 0.020);
            maxBound    ( 0.020 0.075 0.020);
        }

        // Shoulder at y = 25 mm. These four non-overlapping rectangles
        // cover the 40 mm square except for the central 10 mm opening.
        shoulder_zPlus
        {
            material    wall;
            nVec        (0 -1 0);
            planePoint  (0 0.025 0);

            finitePatch true;
            minBound    (-0.020 0.025 0.005);
            maxBound    ( 0.020 0.025 0.020);
        }

        shoulder_zMinus
        {
            material    wall;
            nVec        (0 -1 0);
            planePoint  (0 0.025 0);

            finitePatch true;
            minBound    (-0.020 0.025 -0.020);
            maxBound    ( 0.020 0.025 -0.005);
        }

        shoulder_xPlus
        {
            material    wall;
            nVec        (0 -1 0);
            planePoint  (0 0.025 0);

            finitePatch true;
            minBound    (0.005 0.025 -0.005);
            maxBound    (0.020 0.025  0.005);
        }

        shoulder_xMinus
        {
            material    wall;
            nVec        (0 -1 0);
            planePoint  (0 0.025 0);

            finitePatch true;
            minBound    (-0.020 0.025 -0.005);
            maxBound    (-0.005 0.025  0.005);
        }

        // bottomOutlet and topOpen intentionally have no DEM collision wall.
    }
}

virtualMesh
{
    level        4;
    charCellSize 0.0005;
}

PH_SC_prefill
{
    fullyCoupledBody
    {
        velocity (0 -0.005 0);
    }

    rho         rho [1 -3 0 0 0 0 0] 2500;

    refineMC    5;

    U
    {
        BC noSlip;
    }

    bodyAddition
    {
        // Fill the complete upstream reservoir once at t = 0.  Unlike the
        // persistent inlet model below, onceScatter never refills this region.
        addModel onceScatter;

        onceScatterCoeffs
        {
            addMode fieldBased;
            fieldBasedCoeffs
            {
                fieldName  lambda;
                fieldValue 0.2;
            }

            addDomain boundBox;
            boundBoxCoeffs
            {
                minBound (-0.020 0.025 -0.020);
                maxBound ( 0.020 0.075  0.020);
            }

            scalingMode noScaling;
            noScalingCoeffs
            {
            }

            rotationMode uniformRandomRotation;
            uniformRandomRotationCoeffs
            {
            }
        }
    }

    material         particle;
    bodyGeom         convex;
    updateTorque     true;
    sdBasedLambda    false;
    interfaceSpan    1.0;
    startSynced      true;
    refineBuffers    0;
    timesToSetStatic -1;
}

PH_SC_inlet
{
    fullyCoupledBody
    {
        velocity (0 -0.005 0);
    }

    rho         rho [1 -3 0 0 0 0 0] 2500;

    refineMC    5;

    U
    {
        BC noSlip;
    }

    bodyAddition
    {
        // Maintain phi = 0.20 only in the upper 10 mm source slab.
        addModel repeatRandomPosition;

        repeatRandomPositionCoeffs
        {
            addMode fieldBased;
            fieldBasedCoeffs
            {
                fieldName  lambda;
                fieldValue 0.2;
            }

            addDomain boundBox;
            boundBoxCoeffs
            {
                minBound (-0.020 0.065 -0.020);
                maxBound ( 0.020 0.075  0.020);
            }

            scalingMode noScaling;
            noScalingCoeffs
            {
            }

            rotationMode uniformRandomRotation;
            uniformRandomRotationCoeffs
            {
            }
        }
    }

    material         particle;
    bodyGeom         convex;
    updateTorque     true;
    sdBasedLambda    false;
    interfaceSpan    1.0;
    startSynced      true;
    refineBuffers    0;
    timesToSetStatic -1;
}

// ************************************************************************* //
