examples/09_k3.0_flow/0.org/lambda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      lambda;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottomOutlet
    {
        type            zeroGradient;
    }

    topOpen
    {
        type            zeroGradient;
    }

    contractionWall
    {
        type            zeroGradient;
    }

    xMinWall
    {
        type            zeroGradient;
    }

    xMaxWall
    {
        type            zeroGradient;
    }

    zMinWall
    {
        type            zeroGradient;
    }

    zMaxWall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //

